; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   microwavetype sinkbasintype fridgetype - receptacletype
   knifetype butterknifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   bedtype countertoptype stoveburnertype coffeemachinetype ottomantype - receptacletype
   remotecontroltype saltshakertype tomatotype glassbottletype platetype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   bed_1 countertop_2 stoveburner_3 coffeemachine_4 ottoman_5 microwave_6 fridge_7 - receptacle
   remotecontrol_1 saltshaker_2 tomato_3 glassbottle_4 plate_5 - obj
 )
 (:init (receptacletype_0 bed_1 bedtype) (receptacletype_0 countertop_2 countertoptype) (receptacletype_0 stoveburner_3 stoveburnertype) (receptacletype_0 coffeemachine_4 coffeemachinetype) (receptacletype_0 ottoman_5 ottomantype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 remotecontrol_1 remotecontroltype) (objecttype_0 saltshaker_2 saltshakertype) (objecttype_0 tomato_3 tomatotype) (objecttype_0 glassbottle_4 glassbottletype) (objecttype_0 plate_5 platetype) (cancontain countertoptype remotecontroltype) (cancontain countertoptype saltshakertype) (cancontain countertoptype tomatotype) (cancontain countertoptype glassbottletype) (cancontain countertoptype platetype) (cancontain ottomantype remotecontroltype) (cancontain microwavetype tomatotype) (cancontain microwavetype glassbottletype) (cancontain microwavetype platetype) (cancontain fridgetype tomatotype) (cancontain fridgetype glassbottletype) (cancontain fridgetype platetype) (pickupable remotecontrol_1) (pickupable saltshaker_2) (pickupable tomato_3) (cleanable tomato_3) (heatable tomato_3) (coolable tomato_3) (sliceable tomato_3) (pickupable glassbottle_4) (pickupable plate_5) (isreceptacleobject plate_5) (cleanable plate_5) (heatable plate_5) (coolable plate_5) (receptacleatlocation bed_1 location3) (receptacleatlocation countertop_2 location2) (receptacleatlocation stoveburner_3 location4) (receptacleatlocation coffeemachine_4 location5) (receptacleatlocation ottoman_5 location3) (receptacleatlocation microwave_6 location2) (receptacleatlocation fridge_7 location5) (inreceptacle remotecontrol_1 countertop_2) (inreceptacle saltshaker_2 countertop_2) (inreceptacle tomato_3 countertop_2) (inreceptacle glassbottle_4 microwave_6) (inreceptacle plate_5 countertop_2) (objectatlocation remotecontrol_1 location2) (objectatlocation saltshaker_2 location2) (objectatlocation tomato_3 location2) (objectatlocation glassbottle_4 location2) (objectatlocation plate_5 location2) (atlocation agent1 location1) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (coolable ?o) (objecttype_0 ?o tomatotype) (receptacletype_0 ?r countertoptype) (iscool ?o) (inreceptacle ?o ?r))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location1 location2)
   deleted: (atlocation agent1 location1)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
2. (pickupobject agent1 location2 tomato_3 countertop_2)
   deleted: (inreceptacle tomato_3 countertop_2) (objectatlocation tomato_3 location2)
   added: (holds agent1 tomato_3) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 location2 location5)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location5)
   goals met: 0 of 1
4. (coolobject agent1 location5 fridge_7 tomato_3)
   added: (iscool tomato_3)
   goals met: 0 of 1
5. (gotolocation agent1 location5 location2)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
6. (putobject agent1 location2 tomato_3 countertop_2 tomatotype countertoptype)
   deleted: (holds agent1 tomato_3) (holdsany agent1)
   added: (inreceptacle tomato_3 countertop_2) (objectatlocation tomato_3 location2)
   goals met: 1 of 1
